# Pandas
Pandas is a Python library for managing hetrogenous data.


At its core, Pandas is used for the **DataFrame** object, which is:
- a data structure for labeled rows and columns of data.
- associated methods and utilites for working with data
- each column contains a pandas `Series`

# Setup

In [2]:
# Import standard libraries
# %matplotlib inline
import pandas as pd
import numpy as np

# Loading Data

In [5]:
# Load a csv file of data
df = pd.read_csv("data\my_data.csv")

In [6]:
# Check out a few rows of the dataframe
df.head()

     id first_name last_name  age  score     value
0   295     Andrea     Clark   46     -1  24547.87
1   620       Bill     Woods   46    492  46713.90
2   891  Alexander  Jacobson   48    489  32071.74
3   914    Derrick   Bradley   52     -1  30650.48
4  1736    Allison    Thomas   44     -1   9553.12

In [7]:
# Check out the last few rows of the dataframe
df.tail()

        id first_name last_name  age  score     value
195  97441     Krista     Ortiz   34     -1  24074.79
196  97728       Anna  Chambers   37    598      0.00
197  98115   Jennifer     Pitts   29    606   6876.75
198  98284   Brittany   Jenkins   34    665  43525.88
199  98366    Katelyn     Brown   45    501  29668.38

In [8]:
# Check out both the head and the tail
df

        id first_name last_name  age  score     value
0      295     Andrea     Clark   46     -1  24547.87
1      620       Bill     Woods   46    492  46713.90
2      891  Alexander  Jacobson   48    489  32071.74
3      914    Derrick   Bradley   52     -1  30650.48
4     1736    Allison    Thomas   44     -1   9553.12
..     ...        ...       ...  ...    ...       ...
195  97441     Krista     Ortiz   34     -1  24074.79
196  97728       Anna  Chambers   37    598      0.00
197  98115   Jennifer     Pitts   29    606   6876.75
198  98284   Brittany   Jenkins   34    665  43525.88
199  98366    Katelyn     Brown   45    501  29668.38

[200 rows x 6 columns]

Pandas DataFrame:
- Index for each row (the left side)
- Column name for each column (Series)
- Stores heterogenous types

# Slicing

In [9]:
# Slicing (Indexing): select a Series (column) using its name
df['first_name']
#df#.loc[0] #.set_index('first_name').loc['Andrea']

0         Andrea
1           Bill
2      Alexander
3        Derrick
4        Allison
         ...
195       Krista
196         Anna
197     Jennifer
198     Brittany
199      Katelyn
Name: first_name, Length: 200, dtype: object